apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_serial.c
#ifdef SERIAL_HAVE_RXDMA
static void s32k1xx_dma_rxcallback(DMACH_HANDLE handle, void *arg, bool done,
                                   int result)
{
  struct s32k1xx_uart_s *priv = (struct s32k1xx_uart_s *)arg;
  uint32_t sr;

  if (priv->rxenable && s32k1xx_dma_rxavailable(&priv->dev))
    {
      uart_recvchars(&priv->dev);
    }

  /* Get the masked LPUART status word to check and clear error flags.
   *
   * When wake-up from low power mode was not fast enough, UART is resumed
   * too late and sometimes exactly when character was coming over UART,
   * resulting to frame error.
   * If error flag is not cleared, Rx DMA will be stuck. Clearing errors
   * will release Rx DMA.
   */

  sr = s32k1xx_serialin(priv, S32K1XX_LPUART_STAT_OFFSET);

  if ((sr & (LPUART_STAT_OR | LPUART_STAT_NF | LPUART_STAT_FE)) != 0)
    {
      s32k1xx_serialout(priv, S32K1XX_LPUART_STAT_OFFSET,
                        sr & (LPUART_STAT_OR |
                              LPUART_STAT_NF |
                              LPUART_STAT_FE));
    }
}
#endif

/****************************************************************************
 * Name: up_pm_notify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  unsigned int count = 0;   /* the amount of peripheral clocks to change */

  peripheral_clock_source_t clock_source;

  #ifdef CONFIG_PM_SERIAL0
    struct s32k1xx_uart_s *priv0 = g_lpuart0priv.dev.priv;
  #endif
  #ifdef CONFIG_PM_SERIAL1
    struct s32k1xx_uart_s *priv1 = g_lpuart1priv.dev.priv;
  #endif
  #ifdef CONFIG_PM_SERIAL2
    struct s32k1xx_uart_s *priv2 = g_lpuart2priv.dev.priv;
  #endif

  uint32_t ret_reg = 0;

  /* check if the transition is from the IDLE domain to the NORMAL domain */

  /* or the mode is already done */

  if (((pm_querystate(PM_IDLE_DOMAIN) == PM_IDLE) &&
    (pmstate == PM_NORMAL)) ||
    (((pm_querystate(PM_IDLE_DOMAIN) == pmstate))))
    {
      /* return */

      return;
    }

  /* check which PM it is  */

  switch (pmstate)
  {
    /* in case it needs to change to the RUN mode */

    case PM_NORMAL:
    {
      /* Logic for PM_NORMAL goes here */

      /* set the right clock source to go back to RUN mode */

      clock_source = CLK_SRC_SPLL_DIV2;

      count = 1;
    }
    break;
    default:
    {
      /* don't do anything, just return OK */
    }
    break;
  }

  /* check if something needs to change */

  if (count)
  {
    #ifdef CONFIG_PM_SERIAL0

      /* make the peripheral clock config struct */

      const struct peripheral_clock_config_s clock_config0 =
      {
        .clkname  =   LPUART0_CLK,
        .clkgate  =   true,
        .clksrc   =   clock_source,
        .frac     =   MULTIPLY_BY_ONE,
        .divider  =   1,
      };

      /* read the FIFO register */

      ret_reg = getreg32(priv0->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* make the value */

      ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

      /* write the new value */

      putreg32(ret_reg, priv0->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart0priv);

      /* change the clock config for the new mode */

      s32k1xx_periphclocks(count, &clock_config0);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart0priv);

      /* set up the LPUART1 again for the new mode */

      s32k1xx_setup(&g_lpuart0priv);

      /* enable the interrupts */

      s32k1xx_rxint(&g_lpuart0priv, true);
      s32k1xx_txint(&g_lpuart0priv, true);

    #endif
    #ifdef CONFIG_PM_SERIAL1

      /* make the peripheral clock config struct */

      const struct peripheral_clock_config_s clock_config1 =
      {
        .clkname  =   LPUART1_CLK,
        .clkgate  =   true,
        .clksrc   =   clock_source,
        .frac     =   MULTIPLY_BY_ONE,
        .divider  =   1,
      };

      /* read the FIFO register */

      ret_reg = getreg32(priv1->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* make the value */

      ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

      /* write the new value */

      putreg32(ret_reg, priv1->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart1priv);

      /* change the clock config for the new mode */

      s32k1xx_periphclocks(count, &clock_config1);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart1priv);

      /* set up the LPUART1 again for the new mode */

      s32k1xx_setup(&g_lpuart1priv);

      /* enable the interrupts */

      s32k1xx_rxint(&g_lpuart1priv, true);
      s32k1xx_txint(&g_lpuart1priv, true);

    #endif
    #ifdef CONFIG_PM_SERIAL2

      /* make the peripheral clock config struct */

      const struct peripheral_clock_config_s clock_config2 =
      {
        .clkname  =   LPUART2_CLK,
        .clkgate  =   true,
        .clksrc   =   clock_source,
        .frac     =   MULTIPLY_BY_ONE,
        .divider  =   1,
      };

      /* read the FIFO register */

      ret_reg = getreg32(priv2->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* make the value */

      ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

      /* write the new value */

      putreg32(ret_reg, priv2->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart2priv);

      /* change the clock config for the new mode */

