apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_serial.c
      s32k1xx_periphclocks(count, &clock_config2);

      /* shutdown the LPUART1 (soft reset) */

      s32k1xx_shutdown(&g_lpuart2priv);

      /* set up the LPUART1 again for the new mode */

      s32k1xx_setup(&g_lpuart2priv);

      /* enable the interrupts */

      s32k1xx_rxint(&g_lpuart2priv, true);
      s32k1xx_txint(&g_lpuart2priv, true);

    #endif
  }
}
#endif

/****************************************************************************
 * Name: up_pm_prepare
 *
 * Description:
 *   Request the driver to prepare for a new power state. This is a warning
 *   that the system is about to enter into a new power state. The driver
 *   should begin whatever operations that may be required to enter power
 *   state. The driver may abort the state change mode by returning a
 *   non-zero value from the callback function.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   Zero - (OK) means the event was successfully processed and that the
 *          driver is prepared for the PM state change.
 *
 *   Non-zero - means that the driver is not prepared to perform the tasks
 *              needed achieve this power setting and will cause the state
 *              change to be aborted. NOTE: The prepare() method will also
 *              be called when reverting from lower back to higher power
 *              consumption modes (say because another driver refused a
 *              lower power state change). Drivers are not permitted to
 *              return non-zero values when reverting back to higher power
 *              consumption modes!
 *
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static int up_pm_prepare(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  /* Logic to prepare for a reduced power state goes here. */

  unsigned int count = 1;   /* the amount of peripheral clocks to change */

  peripheral_clock_source_t clock_source;

  #ifdef CONFIG_PM_SERIAL0
    struct s32k1xx_uart_s *priv0 =
        (struct s32k1xx_uart_s *)g_lpuart0priv.dev.priv;
  #endif
  #ifdef CONFIG_PM_SERIAL1
    struct s32k1xx_uart_s *priv1 =
        (struct s32k1xx_uart_s *)g_lpuart1priv.dev.priv;
  #endif
  #ifdef CONFIG_PM_SERIAL2
    struct s32k1xx_uart_s *priv2 =
        (struct s32k1xx_uart_s *)g_lpuart2priv.dev.priv;
  #endif

  uint32_t ret_reg = 0;

  /* check if the transition to the mode is already done */

  if (pm_querystate(PM_IDLE_DOMAIN) == pmstate)
    {
      /* return */

      return OK;
    }

  /* check which PM it is  */

  switch (pmstate)
  {
    /* in case it needs to prepare for VLPR mode */

    case PM_STANDBY:
    {
      /* Logic for PM_STANDBY goes here */

      /* set the right clock source */

      clock_source = CLK_SRC_SIRC_DIV2;
    }
    break;

    /* in case it needs to prepare for sleep mode */

    case PM_SLEEP:
    {
      /* Logic for PM_SLEEP goes here */

      /* set the right clock source */

      clock_source = CLK_SRC_SIRC_DIV2;
    }
    break;
    default:
    {
      /* don't do anything, just return OK */

      return OK;
    }
    break;
  }

  #ifdef CONFIG_PM_SERIAL0

    /* make the peripheral clock config struct */

    const struct peripheral_clock_config_s clock_config0 =
    {
      .clkname  =   LPUART0_CLK,
      .clkgate  =   true,
      .clksrc   =   clock_source,
      .frac     =   MULTIPLY_BY_ONE,
      .divider  =   1,
    };

    /* read the FIFO register */

    ret_reg = getreg32(priv0->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* make the value */

    ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

    /* write the new value */

    putreg32(ret_reg, priv0->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* shutdown the LPUART1 (soft reset) */

    s32k1xx_shutdown(&g_lpuart0priv);

    /* change the clock config for the new mode */

    s32k1xx_periphclocks(count, &clock_config0);

    /* shutdown the LPUART1 (soft reset) */

    s32k1xx_shutdown(&g_lpuart0priv);

    /* set up the LPUART1 again for the new mode */

    s32k1xx_setup(&g_lpuart0priv);

    /* enable the interrupts */

    s32k1xx_rxint(&g_lpuart0priv, true);
    s32k1xx_txint(&g_lpuart0priv, true);

  #endif
  #ifdef CONFIG_PM_SERIAL1

    /* make the peripheral clock config struct */

    const struct peripheral_clock_config_s clock_config1 =
    {
      .clkname  =   LPUART1_CLK,
      .clkgate  =   true,
      .clksrc   =   clock_source,
      .frac     =   MULTIPLY_BY_ONE,
      .divider  =   1,
    };

    /* read the FIFO register */

    ret_reg = getreg32(priv1->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* make the value */

    ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

    /* write the new value */

    putreg32(ret_reg, priv1->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* shutdown the LPUART1 (soft reset) */

    s32k1xx_shutdown(&g_lpuart1priv);

    /* change the clock config for the new mode */

    s32k1xx_periphclocks(count, &clock_config1);

    /* shutdown the LPUART1 (soft reset) */

    s32k1xx_shutdown(&g_lpuart1priv);

    /* set up the LPUART1 again for the new mode */

    s32k1xx_setup(&g_lpuart1priv);

    /* enable the interrupts */

    s32k1xx_rxint(&g_lpuart1priv, true);
    s32k1xx_txint(&g_lpuart1priv, true);

  #endif
  #ifdef CONFIG_PM_SERIAL2

    /* make the peripheral clock config struct */

    const struct peripheral_clock_config_s clock_config2 =
    {
      .clkname  =   LPUART2_CLK,
      .clkgate  =   true,
      .clksrc   =   clock_source,
      .frac     =   MULTIPLY_BY_ONE,
      .divider  =   1,
    };

    /* read the FIFO register */

    ret_reg = getreg32(priv2->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* make the value */

    ret_reg |= (LPUART_FIFO_RXFLUSH + LPUART_FIFO_TXFLUSH);

    /* write the new value */

    putreg32(ret_reg, priv2->uartbase + S32K1XX_LPUART_FIFO_OFFSET);

    /* shutdown the LPUART1 (soft reset) */

    s32k1xx_shutdown(&g_lpuart2priv);

    /* change the clock config for the new mode */

